Перем _ДопустимыеТипы; // ФиксированныйМассив из Тип
Перем _ПроверяющийКадрыОшибок; // ПроверяющийКадрыОшибок

#Область ОбработчикиСобытий

// Создает нормализатор машинных кодов ошибок.
//
// Параметры:
//  ПроверяющийКадрыОшибок - ПроверяющийКадрыОшибок - Проверяющий машинных кодов ошибок.
Процедура ПриСозданииОбъекта(ПроверяющийКадрыОшибок)

	ДопустимыеТипы = Новый Массив;
	ДопустимыеТипы.Добавить(Тип("Строка"));
	ДопустимыеТипы.Добавить(Тип("Массив"));
	ДопустимыеТипы.Добавить(Тип("ФиксированныйМассив"));

	_ДопустимыеТипы = Новый ФиксированныйМассив(ДопустимыеТипы);
	_ПроверяющийКадрыОшибок = ПроверяющийКадрыОшибок;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Проверяет и нормализует один машинный код ошибки.
//
// Параметры:
//  КодОшибки - Строка - Проверяемый машинный код.
//
// Возвращаемое значение:
//  Строка - Нормализованный машинный код.
Функция НормализоватьКод(КодОшибки) Экспорт

	ПроверкаАргументов.ПроверитьТип("КодОшибки", КодОшибки, Тип("Строка"));

	КодОшибки = СокрЛП(КодОшибки);
	_ПроверяющийКадрыОшибок.ПроверитьКодОшибки(КодОшибки);

	Возврат НРег(КодОшибки);

КонецФункции

// Проверяет и нормализует один или несколько машинных кодов ошибок.
//
// Параметры:
//  КодыОшибок - Строка, Массив из Строка, ФиксированныйМассив из Строка - Проверяемые коды.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - Строка - Нормализованный машинный код;
//   * Значение - Булево - Истина.
Функция Нормализовать(КодыОшибок) Экспорт

	ПроверкаАргументов.ПроверитьТип("КодыОшибок", КодыОшибок, _ДопустимыеТипы);

	ЭтоСтрока = ТипЗнч(КодыОшибок) = Тип("Строка");
	Если ЭтоСтрока Тогда
		Коды = СтрРазделить(КодыОшибок, ",", Истина);
	Иначе
		Коды = КодыОшибок;
	КонецЕсли;

	ПроверкаАргументов.ПроверитьЗаполненность("КодыОшибок", Коды);

	Результат = Новый Соответствие;
	Для Каждого КодОшибки Из Коды Цикл
		Если ЭтоСтрока Тогда
			КодОшибки = СокрЛП(КодОшибки);
		КонецЕсли;

		_ПроверяющийКадрыОшибок.ПроверитьКодОшибки(КодОшибки);
		Результат.Вставить(НРег(КодОшибки), Истина);
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти
