#Использовать asserts
#Использовать "../src"
#Использовать "../src/internal"

#Область Тесты

&Тест
Процедура ТестДолжен_СформироватьСообщениеНеверногоТипаАргумента() Экспорт

	// Подготовка
	ИмяАргумента = "Порт";
	ОжидаемыйТип = Строка(Тип("Число"));

	// Действие
	Сообщение = СообщенияОшибокАргументов.НеверныйТип(ИмяАргумента, ОжидаемыйТип);

	// Проверка
	Ожидаем.Что(Сообщение).Содержит("Аргумент 'Порт' должен иметь тип");

КонецПроцедуры

&Тест
Процедура ТестДолжен_СформироватьСообщениеНезаполненногоАргумента() Экспорт

	// Подготовка
	ИмяАргумента = "Имя";

	// Действие
	Сообщение = СообщенияОшибокАргументов.НеЗаполнен(ИмяАргумента);

	// Проверка
	Ожидаем.Что(Сообщение).Содержит("Аргумент 'Имя' должен быть заполнен");

КонецПроцедуры

&Тест
Процедура ТестДолжен_СформироватьСообщениеНедопустимогоЗначенияАргумента() Экспорт

	// Подготовка
	ИмяАргумента = "Количество";
	Ожидание = "быть больше нуля";

	// Действие
	Сообщение = СообщенияОшибокАргументов.НедопустимоеЗначение(ИмяАргумента, Ожидание);

	// Проверка
	Ожидаем.Что(Сообщение).Содержит("Аргумент 'Количество' имеет недопустимое значение");

КонецПроцедуры

&Тест
Процедура ТестДолжен_СформироватьСообщениеАргументаВнеДиапазона() Экспорт

	// Подготовка
	ИмяАргумента = "Порт";
	ОжидаемыйДиапазон = "от 1 до 65535 включительно";

	// Действие
	Сообщение = СообщенияОшибокАргументов.ВнеДиапазона(ИмяАргумента, ОжидаемыйДиапазон);

	// Проверка
	Ожидаем.Что(Сообщение).Содержит("Аргумент 'Порт' находится вне допустимого диапазона");

КонецПроцедуры

&Тест
&Параметры("НеверныйТип")
&Параметры("НеЗаполнен")
&Параметры("НедопустимоеЗначение")
&Параметры("ВнеДиапазона")
Процедура ТестДолжен_ВернутьПользовательскоеСообщение(ВидОшибки) Экспорт

	// Подготовка
	ОжидаемоеСообщение = "Пользовательское сообщение";

	// Действие
	Если ВидОшибки = "НеверныйТип" Тогда
		Сообщение = СообщенияОшибокАргументов.НеверныйТип("Порт", "Число", ОжидаемоеСообщение);
	ИначеЕсли ВидОшибки = "НеЗаполнен" Тогда
		Сообщение = СообщенияОшибокАргументов.НеЗаполнен("Имя", ОжидаемоеСообщение);
	ИначеЕсли ВидОшибки = "НедопустимоеЗначение" Тогда
		Сообщение = СообщенияОшибокАргументов.НедопустимоеЗначение(
			"Количество",
			"быть больше нуля",
			ОжидаемоеСообщение
		);
	Иначе
		Сообщение = СообщенияОшибокАргументов.ВнеДиапазона(
			"Порт",
			"от 1 до 65535 включительно",
			ОжидаемоеСообщение
		);
	КонецЕсли;

	// Проверка
	Ожидаем.Что(Сообщение).Равно(ОжидаемоеСообщение);

КонецПроцедуры

#КонецОбласти
