#Использовать asserts
#Использовать "../src"

#Область Тесты

&Тест
Процедура ТестДолжен_НормализоватьОдинКод() Экспорт

	// Подготовка
	Нормализатор = СервисыБиблиотекиОшибок.НормализаторКодовОшибок();

	// Действие
	КодОшибки = Нормализатор.НормализоватьКод("CORE.Failed");

	// Проверка
	Ожидаем.Что(КодОшибки).Равно("core.failed");

КонецПроцедуры

&Тест
Процедура ТестДолжен_НормализоватьСписокКодов() Экспорт

	// Подготовка
	Нормализатор = СервисыБиблиотекиОшибок.НормализаторКодовОшибок();

	// Действие
	КодыОшибок = Нормализатор.Нормализовать(" CORE.Failed, Storage.Failed ");

	// Проверка
	Ожидаем.Что(КодыОшибок.Получить("core.failed")).Равно(Истина);
	Ожидаем.Что(КодыОшибок.Получить("storage.failed")).Равно(Истина);

КонецПроцедуры

#КонецОбласти
