#Использовать asserts
#Использовать "../src"
#Использовать "../src/internal"

#Область Тесты

&Тест
Процедура ТестДолжен_ИнициализироватьРегулярныеВыраженияПриСоздании() Экспорт

	// Действие
	Проверяющий = Новый ПроверяющийКадрыОшибок();

	// Проверка
	Рефлектор = Новый Рефлектор();
	РегулярноеВыражениеКода = Рефлектор.ПолучитьСвойство(Проверяющий, "_РегулярноеВыражениеКодаОшибки");
	РегулярноеВыражениеГруппы = Рефлектор.ПолучитьСвойство(Проверяющий, "_РегулярноеВыражениеГруппыОшибок");
	Ожидаем.Что(РегулярноеВыражениеКода).ИмеетТип("РегулярноеВыражение");
	Ожидаем.Что(РегулярноеВыражениеГруппы).ИмеетТип("РегулярноеВыражение");

КонецПроцедуры

#КонецОбласти
