#Использовать asserts
#Использовать "../src"
#Использовать "../src/internal"

#Область Тесты

&Тест
Процедура ТестДолжен_ВыделитьВнутреннееСообщениеНативнойОшибки() Экспорт

	// Подготовка
	Ошибка = Новый ИнформацияОбОшибке(
		"External exception (System.IO.IOException): Файл уже существует",
		Новый ФиксированнаяСтруктура(Новый Структура)
	);
	Снимок = Новый СнимокКадраОшибки(Ошибка);
	Цепочка = Новый ЦепочкаКадровОшибки(Снимок);

	// Действие
	Кадры = Цепочка.Кадры();

	// Проверка
	Ожидаем.Что(Кадры[0].НативныйТип).Равно("System.IO.IOException");
	Ожидаем.Что(Кадры[0].ВнутреннееСообщение).Равно("Файл уже существует");

КонецПроцедуры

#КонецОбласти
