#Использовать asserts
#Использовать "../src"
#Использовать "../src/internal"

#Область Тесты

&Тест
Процедура ТестДолжен_ИнициализироватьПараметрыФорматаПриСоздании() Экспорт

	// Действие
	ОписаниеФормата = Новый ОписаниеФорматаКадраОшибки();

	// Проверка
	Рефлектор = Новый Рефлектор();
	Маркер = Рефлектор.ПолучитьСвойство(ОписаниеФормата, "_МаркерМетаданных");
	Версия = Рефлектор.ПолучитьСвойство(ОписаниеФормата, "_ВерсияФормата");
	Ожидаем.Что(Маркер).Равно("onescript.exception.envelope");
	Ожидаем.Что(Версия).Равно(1);

КонецПроцедуры

#КонецОбласти
