#Область СлужебныйПрограммныйИнтерфейс

// Проверяет и нормализует один или несколько машинных кодов ошибок.
//
// Параметры:
//  КодыОшибок - Строка, Массив из Строка, ФиксированныйМассив из Строка - Проверяемые коды.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - Строка - Нормализованный машинный код;
//   * Значение - Булево - Истина.
Функция Разобрать(КодыОшибок) Экспорт

	ДопустимыеТипы = Новый Массив;
	ДопустимыеТипы.Добавить(Тип("Строка"));
	ДопустимыеТипы.Добавить(Тип("Массив"));
	ДопустимыеТипы.Добавить(Тип("ФиксированныйМассив"));

	ПроверкаАргументов.ПроверитьТип("КодыОшибок", КодыОшибок, ДопустимыеТипы);

	Если ТипЗнч(КодыОшибок) = Тип("Строка") Тогда
		Коды = СтрРазделить(КодыОшибок, ",", Истина);
	Иначе
		Коды = КодыОшибок;
	КонецЕсли;

	ПроверкаАргументов.ПроверитьЗаполненность("КодыОшибок", Коды);

	Результат = Новый Соответствие;
	Для Каждого КодОшибки Из Коды Цикл

		Если ТипЗнч(КодыОшибок) = Тип("Строка") Тогда
			КодОшибки = СокрЛП(КодОшибки);
		КонецЕсли;

		ПроверкаКадровОшибок.ПроверитьКодОшибки(КодОшибки);
		Результат.Вставить(НРег(КодОшибки), Истина);

	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти
