#Область ПрограммныйИнтерфейс

// Возвращает вид кадра классифицированной ошибки.
//
// Возвращаемое значение:
//  Строка - Вид кадра классифицированной ошибки.
Функция Ошибка() Экспорт

	Возврат "Ошибка";

КонецФункции

// Возвращает вид контекстного кадра ошибки.
//
// Возвращаемое значение:
//  Строка - Вид контекстного кадра ошибки.
Функция Контекст() Экспорт

	Возврат "Контекст";

КонецФункции

// Возвращает вид внешнего кадра ошибки.
//
// Возвращаемое значение:
//  Строка - Вид внешнего кадра ошибки.
Функция ВнешняяОшибка() Экспорт

	Возврат "ВнешняяОшибка";

КонецФункции

#КонецОбласти
